workstation/openfoam-master-tutorials/tutorials/heatTransfer/buoyantSimpleFoam/comfortHotRoom/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    inlet;
        type    faceSet;
        action  new;
        source  boxToFace;

        box     (-0.001 0.25 1.1)(0.001 0.75 1.3);
    }
    {
        name    outlet;
        type    faceSet;
        action  new;
        source  boxToFace;

        box     (1.75 2.999 0.3)(2.25 3.001 0.5);
    }
);


// ************************************************************************* //
